export default class Hell {
  #isThisHell = true;
  constructor() {

  }
  get theTruth() {
    return {
      is_hell: this.#isThisHell,
      description: "ψ ⛧̷̨̖͕̣̺̩̮̟̟̣̣̻̠̪͚̦̩̦̥͐ ̸͈̲̹̝̱͈̥̬̻̝̌̂͐̀͊̚͜ψ̸̦̩͎̱̼̬̱͓̝͙̫͕͓͇̞̉̌͗͐͌͋̍͜ͅ ̸̢͔̩̹̻̜̓̾̏̆͒͋̏̕⛥̵̢̝̟̙̼̙͕͕̺̯͚̺͕̜̪̣̖̳͔͍̂̿̊̎̌͌ͅ ̷͖̠̟͍͉̝̹̤͍̭͎̞̊̌͐́̀̀̂̂̕͜͠͝ͅt̶̪̳̝͈̞̯̟̃̑́͑̊̑͗̓̕h̷̨̛̹͖͕̞̗͕͈̺͔̱͈̔̑́̈́̆̿́̊̍̀͌̿̆̎͘i̶̡̧̢̹͕̺̼̝͉̼͇̓͊͛̂̏͋̂̈̓̆̃̀̾̾͝s̷̟̺͎̀̓͌͝͠.̶̻̖̫̝̬͓͖̳̭̣̭̹̰͙̑̈̊̏̈́̈́͌͐͐̎̽̐̚͘͝ͅ#̴̠͈̫͈̹̜͉͕͈͍͎̠͍̗͎̻̼̇̽̿̃̃̈́̓͋͋̇̈́̐̾̕͘ͅi̴̛̱̲̘̇̈́s̶̡̨̪̯̺̘͕̮͔̰̰̬̪͓͍̟͌̊̈́͛͂͌͘T̴̡̘̼̼̫̯͚͉̳̜̖̝̪̞̱͔͉͋͂͂͒͝ḥ̶̨̡̛̛͙͍̙̖͎́̓̎͗͐̌̉̓̾̾̀̃͝i̴̢̛̩̠̻̲̘̫̣͙̼͎̱̮̪͍̭̗̩̯̭̾͗̇̎͆s̴͔̪͙̹̹̅̆͗̓͐̓̍͆̒̓̀͘͝H̶̢̻͎̹̱̫͉̳͚̖͔̝̟̟̜͎̖͈̑̒̓̅͆́͛̿̀̂̄̆̾̚̚͘ề̶͇͇̝̈̐͛̆̆̇̔l̶̨̥̝͉̯̤͕͍̠̫̯̄̎̉͂̂͜͝l̷̨̢͎̥̞̊͛́̅̈͊̋ ̷͇̘͕̫͎͙̮̱̣̭̯̪̟̭̺̩̞̝̙̬̉͂͜͠⛧̸̩̮͖͈̟̘͉̻͕̦̓̒͆̒̀̏ ̸̡̛̪̬͎̺̜͔̰̋̎̋͛̓̽̏͗̾☠̷̯̫̓̓̓̐̇́̈̕͠ ̷̨̛͓̙̩̻͒̎̽̎̃͑̈́̌̽͘̕⛥̵̛͉̭̱̮̺̙̞̭̜͙͐̉́͐̾̀̃̂̄͂͘ͅ ☠"
    }
  }
}